app/Views/admin/all-projects.php

SELECT `guestpost_leads`.`id`, COUNT(guestpost_leads.id) as guestpost_count, `projects`.`id`
FROM `guestpost_leads`
LEFT JOIN `projects` ON `projects`.`id` = `guestpost_leads`.`project_id`
WHERE `guestpost_leads`.`project_id` = '2'
---
                                                                                                                                                                                                $leads_count = $GuestPostLeadsModel->select('guestpost_leads.id, COUNT(guestpost_leads.id) as guestpost_count,projects.id')
                                                                                                                                                                                                    ->join('projects', 'projects.id = guestpost_leads.project_id', 'left')

                                                                                                                                                                                                    ->where('guestpost_leads.project_id', $project['id'])->findAll();

SELECT COUNT(*) AS `numrows`
FROM `projects`
LEFT JOIN `users` ON `users`.`id` = `projects`.`user_id`
SELECT `projects`.`id`, `projects`.`name` as `project_name`, `projects`.`user_id`, `projects`.`created_at`, `projects`.`updated_at`, `users`.`name` as `user_name`
FROM `projects`
LEFT JOIN `users` ON `users`.`id` = `projects`.`user_id`
ORDER BY `projects`.`id` DESC
 LIMIT 20
SELECT `guestpost_leads`.`id`, COUNT(guestpost_leads.id) as guestpost_leads_count
FROM `guestpost_leads`
WHERE `guestpost_leads`.`project_id` = '2'
---
                                                                                                                                                                                                echo "(" . $leads_count[0]['guestpost_count'] . ")";
                                                                                                                                                                                                // print("<pre>" . print_r($leads_count[0]['guestpost_count'], true) . "</pre>");
                                                                                                                                                                                                // die('hi');
                                                                                                                                                                                                $all_projects =  $ProductsModel->select('projects.id, projects.name as project_name,projects.user_id,projects.created_at,projects.updated_at,users.name as user_name')
                                                                                                                                                                                                    ->join('users', 'users.id = projects.user_id', 'left')
                                                                                                                                                                                                    ->orderBy('projects.id', 'desc')
                                                                                                                                                                                                    ->paginate(20);
                                                                                                                                                                                                foreach ($all_projects as $project) :
                                                                                                                                                                                                    $leads_count = $GuestPostLeadsModel->select('guestpost_leads.id, COUNT(guestpost_leads.id) as guestpost_leads_count')->where('guestpost_leads.project_id', $project['id'])->findAll();