app/Controllers/AdminController.php

SELECT *
FROM `payment_modes`
WHERE `currency_name` = 'INR'
---
    public function payment_modes($id)
    {
        $PaymentModeModel = new PaymentModeModel();

        $payment_modes = $PaymentModeModel->select('*')->where('currency_name', $id)->findAll();

SELECT *
FROM `payment_modes`
SELECT *
FROM `currencies`
SELECT *
FROM `projects`
SELECT `guestpost_leads`.`id` as `guestpost_id`, `guestpost_leads`.`payment_approvel`, `guestpost_leads`.`user_id`, `guestpost_leads`.`role_id`, `guestpost_leads`.`link`, `guestpost_leads`.`amount`, `guestpost_leads`.`payment_mode_id`, `guestpost_leads`.`payment_status`, `guestpost_leads`.`payee_email`, `guestpost_leads`.`created_at`, `guestpost_leads`.`blogger_name`, `guestpost_leads`.`blogger_email`, `guestpost_leads`.`blogger_phone`, `guestpost_leads`.`agent_email`, `users`.`id` as `userid`, `users`.`name` as `username`, `projects`.`id` as `project_id`, `projects`.`name` as `project_name`, `currencies`.`name` as `currency_name`, `payment_modes`.`name` as `payment_mode`, `guestpost_leads`.`amount`, `guestpost_leads`.`currency_id`, `guestpost_leads`.`payee_number`, `guestpost_leads`.`account_name`, `guestpost_leads`.`account_no`, `guestpost_leads`.`ifsc_code`, `guestpost_leads`.`reference_number` as `ref_num`
FROM `guestpost_leads`
LEFT JOIN `users` ON `users`.`id` = `guestpost_leads`.`user_id`
LEFT JOIN `projects` ON `projects`.`id` = `guestpost_leads`.`Project_id`
LEFT JOIN `currencies` ON `currencies`.`id` = `guestpost_leads`.`currency_id`
LEFT JOIN `payment_modes` ON `payment_modes`.`id` = `guestpost_leads`.`payment_mode_id`
WHERE md5(guestpost_leads.id) = 'eccbc87e4b5ce2fe28308fd9f2a7baf3'
 LIMIT 1
SELECT *
FROM `payment_modes`
WHERE `currency_id` = '2'
SELECT *
FROM `currencies`
WHERE `id` = '2'
 LIMIT 1
SELECT *
FROM `payment_modes`
WHERE `id` = '3'
 LIMIT 1
---
    public function edit_guestpost($id)
    {
        // print_r($id);
        // die('hi');
        $GuestPostLeadsModel = new GuestPostLeadsModel();
        $ProjectsModel = new ProjectsModel();
        $PaymentModeModel = new PaymentModeModel();
        $CurrenciesModel = new CurrenciesModel();
        $all_payment_modes = $PaymentModeModel->select('*')->findAll();
        $all_currencies = $CurrenciesModel->select('*')->findAll();
        // $usd_payment_modes = $PaymentModeModel->select('*')->where('currency_id', 1)->findAll();
        // $inr_payment_modes = $PaymentModeModel->select('*')->where('currency_id', 2)->findAll();
        // $project = $ProjectsModel->select('*')->where('id', $id)->first();
        $projects = $ProjectsModel->select('*')->findAll();
        $guestpost_details = $GuestPostLeadsModel->select('guestpost_leads.id as guestpost_id ,guestpost_leads.payment_approvel,guestpost_leads.user_id,guestpost_leads.role_id,guestpost_leads.link,guestpost_leads.amount,guestpost_leads.payment_mode_id,guestpost_leads.payment_status,guestpost_leads.payee_email,guestpost_leads.created_at,guestpost_leads.blogger_name,guestpost_leads.blogger_email,guestpost_leads.blogger_phone,guestpost_leads.agent_email,users.id as userid,users.name as username, projects.id as project_id, projects.name as project_name,currencies.name as currency_name,payment_modes.name as payment_mode,guestpost_leads.amount,guestpost_leads.currency_id,guestpost_leads.payee_number,guestpost_leads.account_name,guestpost_leads.account_no,guestpost_leads.ifsc_code,guestpost_leads.reference_number as ref_num')
            ->join('users', 'users.id = guestpost_leads.user_id', 'left')
            ->join('projects', 'projects.id = guestpost_leads.Project_id', 'left')
            ->join('currencies', 'currencies.id = guestpost_leads.currency_id', 'left')
            ->join('payment_modes', 'payment_modes.id = guestpost_leads.payment_mode_id', 'left')
            ->where('md5(guestpost_leads.id)', $id)->first();
        // $check_payment = $CurrenciesModel->select('*')->where('id', $guestpost_currency_id)->first();
        $guestpost_currency_id = $guestpost_details['currency_id'];
        $guestpost_payment_mode_id = $guestpost_details['payment_mode_id'];
        $selected_currency = $CurrenciesModel->select('*')->where('id', $guestpost_currency_id)->first();
        $selected_payment_mode = $PaymentModeModel->select('*')->where('id', $guestpost_payment_mode_id)->first();