app/Controllers/AdminController.php

    public function view_project_leads($id)
    {
        $GuestPostLeadsModel = new GuestPostLeadsModel();

        $project_leads = $GuestPostLeadsModel->select('guestpost_leads.id as guestpost_id,guestpost_leads.id as guestpost_id, guestpost_leads.user_id, guestpost_leads.role_id, guestpost_leads.project_id, guestpost_leads.link, guestpost_leads.amount,guestpost_leads.currency_id,guestpost_leads.payment_mode_id, guestpost_leads.payment_status,guestpost_leads.payment_approvel,guestpost_leads.payment_approvel,guestpost_leads.reference_number,guestpost_leads.created_at ,guestpost_leads.updated_at,users.name as user_name,currencies.name as currency_name,payment_modes.name as payment_mode')
            ->join('projects', 'guestpost_leads.project_id = projects.id', 'left')
            ->join('users', 'guestpost_leads.user_id = users.id', 'left')
            ->join('currencies', 'guestpost_leads.currency_id = currencies.id', 'left')
            ->join('payment_modes', 'guestpost_leads.payment_mode_id = payment_modes.id', 'left')
            ->where('md5(guestpost_leads.project_id)', $id)->paginate(20);
---
SELECT `guestpost_leads`.`id`, `guestpost_leads`.`payment_approvel`, `guestpost_leads`.`user_id`, `guestpost_leads`.`role_id`, `guestpost_leads`.`link`, `guestpost_leads`.`amount`, `guestpost_leads`.`currency`, `guestpost_leads`.`payment_mode`, `guestpost_leads`.`payment_status`, `guestpost_leads`.`reference_number`, `guestpost_leads`.`created_at`, `users`.`id` as `userid`, `users`.`name` as `username`, `projects`.`id` as `project_id`, `projects`.`name` as `project_name`
FROM `guestpost_leads`
LEFT JOIN `users` ON `users`.`id` = `guestpost_leads`.`user_id`
LEFT JOIN `projects` ON `projects`.`id` = `guestpost_leads`.`project_id`
WHERE DATE(guestpost_leads.created_at) >= '2023-07-01'
AND DATE(guestpost_leads.created_at) <= '2023-07-31'
ORDER BY `guestpost_leads`.`id` DESC