app/Controllers/AdminController.php

SELECT *
FROM `projects`
SELECT *
FROM `payment_modes`
SELECT *
FROM `currencies`
SELECT `blogger_name`
FROM `guestpost_leads`
GROUP BY `blogger_name`
SELECT COUNT(*) AS `numrows`
FROM `guestpost_leads`
LEFT JOIN `users` ON `users`.`id` = `guestpost_leads`.`user_id`
LEFT JOIN `projects` ON `projects`.`id` = `guestpost_leads`.`project_id`
LEFT JOIN `currencies` ON `currencies`.`id` = `guestpost_leads`.`currency_id`
LEFT JOIN `payment_modes` ON `payment_modes`.`id` = `guestpost_leads`.`payment_mode_id`
WHERE DATE(guestpost_leads.created_at) >= '2023-11-01'
AND DATE(guestpost_leads.created_at) <= '2023-11-30'
SELECT `guestpost_leads`.`id`, `guestpost_leads`.`updated_at`, `guestpost_leads`.`blogger_name`, `guestpost_leads`.`payment_approvel`, `guestpost_leads`.`user_id`, `guestpost_leads`.`role_id`, `guestpost_leads`.`link`, `guestpost_leads`.`amount`, `guestpost_leads`.`currency_id`, `guestpost_leads`.`payment_mode_id`, `guestpost_leads`.`is_flag`, `guestpost_leads`.`payment_status`, `guestpost_leads`.`reference_number`, `guestpost_leads`.`created_at`, `users`.`id` as `userid`, `users`.`name` as `username`, `projects`.`id` as `project_id`, `projects`.`name` as `project_name`, `currencies`.`name` as `currency_name`, `payment_modes`.`name` as `payment_mode`
FROM `guestpost_leads`
LEFT JOIN `users` ON `users`.`id` = `guestpost_leads`.`user_id`
LEFT JOIN `projects` ON `projects`.`id` = `guestpost_leads`.`project_id`
LEFT JOIN `currencies` ON `currencies`.`id` = `guestpost_leads`.`currency_id`
LEFT JOIN `payment_modes` ON `payment_modes`.`id` = `guestpost_leads`.`payment_mode_id`
WHERE DATE(guestpost_leads.created_at) >= '2023-09-01'
AND DATE(guestpost_leads.created_at) <= '2023-09-30'
ORDER BY `guestpost_leads`.`id` DESC
 LIMIT 20
---
    public function guest_posting_leads()
    {
        $GuestPostLeadsModel = new GuestPostLeadsModel();
        $ProjectsModel = new ProjectsModel();
        $PaymentModeModel = new PaymentModeModel();
        $CurrenciesModel = new CurrenciesModel();
        $all_projects = $ProjectsModel->select('*')->findAll();
        $all_payment_modes = $PaymentModeModel->select('*')->findAll();
        $all_Currencies = $CurrenciesModel->select('*')->findAll();
        $blogger_names = $GuestPostLeadsModel->select('blogger_name')
            ->groupBy('blogger_name')
            ->findAll();
        // print("<pre>" . print_r($blogger_names, true) . "</pre>");
        // die();
        $currentDate = date('Y-m-d');
        $firstDayOfMonth = date('Y-m-01', strtotime($currentDate));
        $lastDayOfMonth = date('Y-m-t', strtotime($currentDate));
        $all_guestposts = $GuestPostLeadsModel->select('guestpost_leads.id,guestpost_leads.updated_at ,guestpost_leads.blogger_name,guestpost_leads.payment_approvel,guestpost_leads.user_id,guestpost_leads.role_id,guestpost_leads.link,guestpost_leads.amount,guestpost_leads.currency_id,guestpost_leads.payment_mode_id,guestpost_leads.is_flag,guestpost_leads.payment_status,guestpost_leads.reference_number,guestpost_leads.created_at,users.id as userid,users.name as username,projects.id as project_id,projects.name as project_name,currencies.name as currency_name,payment_modes.name as payment_mode')
            ->join('users', 'users.id = guestpost_leads.user_id', 'left')
            ->join('projects', 'projects.id = guestpost_leads.project_id', 'left')
            ->join('currencies', 'currencies.id = guestpost_leads.currency_id', 'left')
            ->join('payment_modes', 'payment_modes.id = guestpost_leads.payment_mode_id', 'left')
            ->where('DATE(guestpost_leads.created_at) >=', $firstDayOfMonth)
            ->where('DATE(guestpost_leads.created_at) <=', $lastDayOfMonth)
            ->orderBy('guestpost_leads.id', 'desc')->paginate(20);

SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `role` ON `role`.`id` = `users`.`role_id`
SELECT `users`.`id` as `user_id`, `users`.`name` as `username`, `users`.`phone`, `users`.`email`, `role`.`id` as `role_id`, `role`.`name` as `role`
FROM `users`
JOIN `role` ON `role`.`id` = `users`.`role_id`
ORDER BY `users`.`id` DESC
 LIMIT 20
---
    public function manage_users()
    {
        $session = session();
        $UsersModel = new UsersModel();
        $all_users = $UsersModel->select('users.id as user_id, users.name as username ,users.phone, users.email, role.id as role_id, role.name as role')
            ->join('role', 'role.id = users.role_id')->orderBy('users.id', 'desc')->paginate(20);

UPDATE `guestpost_leads` SET `payment_approvel` = 1
WHERE `guestpost_leads`.`id` IN ('3')
---
    public function approve_payment($id)
    {
        $GuestPostLeadsModel = new GuestPostLeadsModel();
        $agent_email = $GuestPostLeadsModel->select('*')->where('id', $id)->first();
        // print_r($agent_email['agent_email']);
        // die('hi');
        $payment_status = 1;
        $data = [
            'payment_approvel' => $payment_status,
        ];
        $approved =  $GuestPostLeadsModel->update($id, $data);

SELECT *
FROM `payment_modes`
SELECT *
FROM `currencies`
SELECT *
FROM `projects`
SELECT `guestpost_leads`.`id` as `guestpost_id`, `guestpost_leads`.`payment_approvel`, `guestpost_leads`.`user_id`, `guestpost_leads`.`role_id`, `guestpost_leads`.`link`, `guestpost_leads`.`amount`, `guestpost_leads`.`currency_id`, `guestpost_leads`.`payment_mode_id`, `guestpost_leads`.`payment_status`, `guestpost_leads`.`reference_number`, `guestpost_leads`.`created_at`, `users`.`id` as `userid`, `users`.`name` as `username`, `projects`.`id` as `project_id`, `projects`.`name` as `project_name`, `currencies`.`id` as `currency_id`, `currencies`.`name` as `currency_name`, `payment_modes`.`name` as `payment_mode`
FROM `guestpost_leads`
LEFT JOIN `users` ON `users`.`id` = `guestpost_leads`.`user_id`
LEFT JOIN `projects` ON `projects`.`id` = `guestpost_leads`.`Project_id`
LEFT JOIN `currencies` ON `currencies`.`id` = `guestpost_leads`.`currency_id`
LEFT JOIN `payment_modes` ON `payment_modes`.`id` = `guestpost_leads`.`payment_mode_id`
WHERE md5(guestpost_leads.id) = 'c81e728d9d4c2f636f067f89cc14862c'
ORDER BY `guestpost_leads`.`id` DESC
 LIMIT 1
---
    public function edit_guestpost($id)
    {
        // print_r($id);
        // die('hi');
        $GuestPostLeadsModel = new GuestPostLeadsModel();
        $ProjectsModel = new ProjectsModel();
        $PaymentModeModel = new PaymentModeModel();
        $CurrenciesModel = new CurrenciesModel();
        $all_payment_modes = $PaymentModeModel->select('*')->findAll();
        $all_currencies = $CurrenciesModel->select('*')->findAll();
        // $project = $ProjectsModel->select('*')->where('id', $id)->first();
        $projects = $ProjectsModel->select('*')->findAll();
        $all_guestposts = $GuestPostLeadsModel->select('guestpost_leads.id as guestpost_id ,guestpost_leads.payment_approvel,guestpost_leads.user_id,guestpost_leads.role_id,guestpost_leads.link,guestpost_leads.amount,guestpost_leads.currency_id,guestpost_leads.payment_mode_id,guestpost_leads.payment_status,guestpost_leads.reference_number,guestpost_leads.created_at,users.id as userid,users.name as username, projects.id as project_id, projects.name as project_name,currencies.id as currency_id,currencies.name as currency_name,payment_modes.name as payment_mode')
            ->join('users', 'users.id = guestpost_leads.user_id', 'left')
            ->join('projects', 'projects.id = guestpost_leads.Project_id', 'left')
            ->join('currencies', 'currencies.id = guestpost_leads.currency_id', 'left')
            ->join('payment_modes', 'payment_modes.id = guestpost_leads.payment_mode_id', 'left')
            ->where('md5(guestpost_leads.id)', $id)->orderBy('guestpost_leads.id', 'desc')->first();

SELECT COUNT(*) AS `numrows`
FROM `projects`
LEFT JOIN `users` ON `users`.`id` = `projects`.`user_id`
SELECT `projects`.`id`, `projects`.`name` as `project_name`, `projects`.`user_id`, `projects`.`created_at`, `projects`.`updated_at`, `users`.`name` as `user_name`
FROM `projects`
LEFT JOIN `users` ON `users`.`id` = `projects`.`user_id`
ORDER BY `projects`.`id` DESC
 LIMIT 20
---
    public function all_projects()
    {
        $ProductsModel = new ProjectsModel();
        $all_projects =  $ProductsModel->select('projects.id, projects.name as project_name,projects.user_id,projects.created_at,projects.updated_at,users.name as user_name')
            ->join('users', 'users.id = projects.user_id', 'left')
            ->orderBy('projects.id', 'desc')
            ->paginate(20);

SELECT *
FROM `projects`
SELECT *
FROM `payment_modes`
SELECT *
FROM `currencies`
SELECT `blogger_name`
FROM `guestpost_leads`
GROUP BY `blogger_name`
---
    public function guestpost_leads_date_range()
    {
        // die('hi');
        $GuestPostLeadsModel = new GuestPostLeadsModel();
        $ProjectsModel = new ProjectsModel();
        $PaymentModeModel = new PaymentModeModel();
        $CurrenciesModel = new CurrenciesModel();
        $all_projects = $ProjectsModel->select('*')->findAll();
        $all_payment_modes = $PaymentModeModel->select('*')->findAll();
        $all_Currencies = $CurrenciesModel->select('*')->findAll();
        $blogger_names = $GuestPostLeadsModel->select('blogger_name')
            ->groupBy('blogger_name')
            ->findAll();