app/Controllers/AgentController.php

SELECT COUNT(*) AS `numrows`
FROM `guestpost_leads`
LEFT JOIN `users` ON `users`.`id` = `guestpost_leads`.`user_id`
LEFT JOIN `currencies` ON `currencies`.`id` = `guestpost_leads`.`currency_id`
LEFT JOIN `payment_modes` ON `payment_modes`.`id` = `guestpost_leads`.`payment_mode_id`
LEFT JOIN `projects` ON `projects`.`id` = `guestpost_leads`.`project_id`
SELECT `guestpost_leads`.`id`, `guestpost_leads`.`payment_approvel`, `guestpost_leads`.`user_id`, `guestpost_leads`.`role_id`, `guestpost_leads`.`link`, `guestpost_leads`.`amount`, `guestpost_leads`.`currency_id`, `guestpost_leads`.`payment_mode_id`, `guestpost_leads`.`payment_status`, `guestpost_leads`.`reference_number`, `guestpost_leads`.`created_at`, `users`.`id` as `userid`, `users`.`name` as `username`, `projects`.`id` as `project_id`, `projects`.`name` as `project_name`, `currencies`.`name` as `currency_name`, `payment_modes`.`name` as `payment_mode`
FROM `guestpost_leads`
LEFT JOIN `users` ON `users`.`id` = `guestpost_leads`.`user_id`
LEFT JOIN `currencies` ON `currencies`.`id` = `guestpost_leads`.`currency_id`
LEFT JOIN `payment_modes` ON `payment_modes`.`id` = `guestpost_leads`.`payment_mode_id`
LEFT JOIN `projects` ON `projects`.`id` = `guestpost_leads`.`project_id`
ORDER BY `guestpost_leads`.`id` DESC
 LIMIT 20
---
    public function guest_posting_leads()
    {
        $session = session();
        $GuestPostLeadsModel = new GuestPostLeadsModel();



        // print_r($all_currencies);
        // die('hi');

        $all_guestposts = $GuestPostLeadsModel->select('guestpost_leads.id ,guestpost_leads.payment_approvel,guestpost_leads.user_id,guestpost_leads.role_id,guestpost_leads.link,guestpost_leads.amount,guestpost_leads.currency_id,guestpost_leads.payment_mode_id,guestpost_leads.payment_status,guestpost_leads.reference_number,guestpost_leads.created_at,users.id as userid,users.name as username,projects.id as project_id,projects.name as project_name,currencies.name as currency_name,payment_modes.name as payment_mode')
            ->join('users', 'users.id = guestpost_leads.user_id', 'left')
            ->join('currencies', 'currencies.id = guestpost_leads.currency_id', 'left')
            ->join('payment_modes', 'payment_modes.id = guestpost_leads.payment_mode_id', 'left')
            ->join('projects', 'projects.id = guestpost_leads.project_id', 'left')->orderBy('guestpost_leads.id', 'desc')->paginate(20);

SELECT *
FROM `payment_modes`
SELECT *
FROM `currencies`
SELECT *
FROM `projects`
SELECT `guestpost_leads`.`id` as `guestpost_id`, `guestpost_leads`.`payment_approvel`, `guestpost_leads`.`user_id`, `guestpost_leads`.`role_id`, `guestpost_leads`.`link`, `guestpost_leads`.`amount`, `guestpost_leads`.`currency_id`, `guestpost_leads`.`payment_mode_id`, `guestpost_leads`.`payment_status`, `guestpost_leads`.`reference_number`, `guestpost_leads`.`created_at`, `users`.`id` as `userid`, `users`.`name` as `username`, `projects`.`id` as `project_id`, `projects`.`name` as `project_name`, `currencies`.`name` as `currency_name`, `payment_modes`.`name` as `payment_mode`
FROM `guestpost_leads`
LEFT JOIN `users` ON `users`.`id` = `guestpost_leads`.`user_id`
LEFT JOIN `projects` ON `projects`.`id` = `guestpost_leads`.`Project_id`
LEFT JOIN `currencies` ON `currencies`.`id` = `guestpost_leads`.`currency_id`
LEFT JOIN `payment_modes` ON `payment_modes`.`id` = `guestpost_leads`.`payment_mode_id`
WHERE md5(guestpost_leads.id) = 'c81e728d9d4c2f636f067f89cc14862c'
 LIMIT 1
---
    public function edit_guestpost($id)
    {
        $GuestPostLeadsModel = new GuestPostLeadsModel();
        $ProjectsModel = new ProjectsModel();

        $PaymentModeModel = new PaymentModeModel();
        $CurrenciesModel = new CurrenciesModel();
        $all_payment_modes = $PaymentModeModel->select('*')->findAll();
        $all_currencies = $CurrenciesModel->select('*')->findAll();

        // $project = $ProjectsModel->select('*')->where('id', $id)->first();
        $projects = $ProjectsModel->select('*')->findAll();
        $all_guestposts = $GuestPostLeadsModel->select('guestpost_leads.id as guestpost_id ,guestpost_leads.payment_approvel,guestpost_leads.user_id,guestpost_leads.role_id,guestpost_leads.link,guestpost_leads.amount,guestpost_leads.currency_id,guestpost_leads.payment_mode_id,guestpost_leads.payment_status,guestpost_leads.reference_number,guestpost_leads.created_at,users.id as userid,users.name as username, projects.id as project_id, projects.name as project_name,currencies.name as currency_name,payment_modes.name as payment_mode')
            ->join('users', 'users.id = guestpost_leads.user_id', 'left')
            ->join('projects', 'projects.id = guestpost_leads.Project_id', 'left')
            ->join('currencies', 'currencies.id = guestpost_leads.currency_id', 'left')
            ->join('payment_modes', 'payment_modes.id = guestpost_leads.payment_mode_id', 'left')
            ->where('md5(guestpost_leads.id)', $id)->first();