app/Controllers/AgentController.php

    public function guest_posting()
    {
        $ProjectsModel = new ProjectsModel();
        $PaymentModeModel = new PaymentModeModel();
        $CurrenciesModel = new CurrenciesModel();
        $all_payment_modes = $PaymentModeModel->select('*')->findAll();
        $all_currencies = $CurrenciesModel->select('*')->findAll();
        $projects = $ProjectsModel->select('*')->findAll();
---
SELECT *
FROM `payment_modes`
SELECT *
FROM `currencies`
SELECT *
FROM `projects`

    public function guest_posting_leads()
    {
        $session = session();
        $currenct_agent_id = session()->get('id');
        $GuestPostLeadsModel = new GuestPostLeadsModel();
        $ProjectsModel = new ProjectsModel();
        $PaymentModeModel = new PaymentModeModel();
        $CurrenciesModel = new CurrenciesModel();
        $all_projects = $ProjectsModel->select('*')->findAll();
        $all_payment_modes = $PaymentModeModel->select('*')->findAll();
        $all_Currencies = $CurrenciesModel->select('*')->findAll();
        $blogger_names = $GuestPostLeadsModel->select('blogger_name')
            ->groupBy('blogger_name')
            ->findAll();
        $currentDate = date('Y-m-d');
        $firstDayOfMonth = date('Y-m-01', strtotime($currentDate));
        $lastDayOfMonth = date('Y-m-t', strtotime($currentDate));
        $all_guestposts = $GuestPostLeadsModel->select('guestpost_leads.id,guestpost_leads.updated_at ,guestpost_leads.blogger_name,guestpost_leads.payment_approvel,guestpost_leads.user_id,guestpost_leads.role_id,guestpost_leads.link,guestpost_leads.is_flag,guestpost_leads.payment_status,guestpost_leads.created_at,users.id as userid,users.name as username,projects.id as project_id,projects.name as project_name,currencies.name as currency_name,payment_modes.name as payment_mode,guestpost_leads.payee_email,payment_details.currency_id as pmt_currency,payment_details.payment_mode_id,payment_details.amount,payment_details.currency_id,payment_details.payee_number,payment_details.account_name,payment_details.account_no,payment_details.ifsc_code,payment_details.reference_number')
            ->join('users', 'users.id = guestpost_leads.user_id', 'left')
            ->join('currencies', 'currencies.id = guestpost_leads.currency_id', 'left')
            ->join('payment_modes', 'payment_modes.id = guestpost_leads.payment_mode_id', 'left')
            ->join('projects', 'projects.id = guestpost_leads.project_id', 'left')
            ->join('payment_details', 'payment_details.guestpost_id = guestpost_leads.id', 'left')
            ->where('DATE(guestpost_leads.created_at) >=', $firstDayOfMonth)
            ->where('DATE(guestpost_leads.created_at) <=', $lastDayOfMonth)
            ->where('guestpost_leads.user_id', $currenct_agent_id)
            ->orderBy('guestpost_leads.id', 'desc')->paginate(20);
---
SELECT *
FROM `projects`
SELECT *
FROM `payment_modes`
SELECT *
FROM `currencies`
SELECT `blogger_name`
FROM `guestpost_leads`
GROUP BY `blogger_name`
SELECT COUNT(*) AS `numrows`
FROM `guestpost_leads`
LEFT JOIN `users` ON `users`.`id` = `guestpost_leads`.`user_id`
LEFT JOIN `currencies` ON `currencies`.`id` = `guestpost_leads`.`currency_id`
LEFT JOIN `payment_modes` ON `payment_modes`.`id` = `guestpost_leads`.`payment_mode_id`
LEFT JOIN `projects` ON `projects`.`id` = `guestpost_leads`.`project_id`
LEFT JOIN `payment_details` ON `payment_details`.`guestpost_id` = `guestpost_leads`.`id`
WHERE DATE(guestpost_leads.created_at) >= '2023-10-01'
AND DATE(guestpost_leads.created_at) <= '2023-10-31'
AND `guestpost_leads`.`user_id` = '2'
SELECT `guestpost_leads`.`id`, `guestpost_leads`.`updated_at`, `guestpost_leads`.`blogger_name`, `guestpost_leads`.`payment_approvel`, `guestpost_leads`.`user_id`, `guestpost_leads`.`role_id`, `guestpost_leads`.`link`, `guestpost_leads`.`is_flag`, `guestpost_leads`.`payment_status`, `guestpost_leads`.`created_at`, `users`.`id` as `userid`, `users`.`name` as `username`, `projects`.`id` as `project_id`, `projects`.`name` as `project_name`, `currencies`.`name` as `currency_name`, `payment_modes`.`name` as `payment_mode`, `guestpost_leads`.`payee_email`, `payment_details`.`currency_id` as `pmt_currency`, `payment_details`.`payment_mode_id`, `payment_details`.`amount`, `payment_details`.`currency_id`, `payment_details`.`payee_number`, `payment_details`.`account_name`, `payment_details`.`account_no`, `payment_details`.`ifsc_code`, `payment_details`.`reference_number`
FROM `guestpost_leads`
LEFT JOIN `users` ON `users`.`id` = `guestpost_leads`.`user_id`
LEFT JOIN `currencies` ON `currencies`.`id` = `guestpost_leads`.`currency_id`
LEFT JOIN `payment_modes` ON `payment_modes`.`id` = `guestpost_leads`.`payment_mode_id`
LEFT JOIN `projects` ON `projects`.`id` = `guestpost_leads`.`project_id`
LEFT JOIN `payment_details` ON `payment_details`.`guestpost_id` = `guestpost_leads`.`id`
WHERE DATE(guestpost_leads.created_at) >= '2023-10-01'
AND DATE(guestpost_leads.created_at) <= '2023-10-31'
AND `guestpost_leads`.`user_id` = '2'
ORDER BY `guestpost_leads`.`id` DESC
 LIMIT 20