app/Controllers/AgentController.php

UPDATE `guestpost_leads` SET `project_id` = '1', `amount` = '121233', `currency_id` = '2', `payment_mode_id` = '2', `payment_status` = '0', `updated_at` = '2023-09-04 12:51:pm'
WHERE `guestpost_leads`.`id` IN ('2')
---
                // print("<pre>" . print_r($data, true) . "</pre>");
                // die('hi');
                if (!$existing_reference_number) {
                    $GuestPostLeadsModel->update($id, $data);