app/Controllers/ManagerController.php

SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `role` ON `role`.`id` = `users`.`role_id`
SELECT `users`.`id` as `user_id`, `users`.`name` as `username`, `users`.`phone`, `users`.`email`, `role`.`id` as `role_id`, `role`.`name` as `role`
FROM `users`
JOIN `role` ON `role`.`id` = `users`.`role_id`
ORDER BY `users`.`id` DESC
 LIMIT 20
---
    public function manage_users()
    {
        $session = session();
        $UsersModel = new UsersModel();
        $all_users = $UsersModel->select('users.id as user_id, users.name as username ,users.phone, users.email, role.id as role_id, role.name as role')
            ->join('role', 'role.id = users.role_id')->orderBy('users.id', 'desc')->paginate(20);