app/Controllers/UsersController.php

SELECT *
FROM `users`
WHERE `email` = 'priyanka@eseo.com'
 LIMIT 1
SELECT `users`.`id` as `user_id`, `users`.`name` as `username`, `users`.`email`, `role`.`id` as `role_id`, `role`.`name` as `role`
FROM `users`
LEFT JOIN `role` ON `role`.`id` = `users`.`role_id`
WHERE `users`.`id` = '2'
 LIMIT 1
---
    public function loginAuth()
    {
        $session = session();
        $UsersModel = new UsersModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $data = $UsersModel->where('email', $email)->first();

        if ($data) {
            $pass = $data['password'];
            $authenticatePassword = password_verify($password, $pass);
            $userprofile = $UsersModel->select('users.id as user_id, users.name as username , users.email, role.id as role_id, role.name as role')
                ->join('role', 'role.id = users.role_id', 'left')
                ->where('users.id', $data['id'])
                ->first();